#გამოცდის ქულა და შეფასება
#პროგრამა მომხმარებელს სთხოვს გამოცდის ქულის შეყვანას და შეფასების განსაზღვრას.

 
#ინსტრუქციებიი
#თუ ქულა 90-ზე მეტია, შეფასება იყოს "A".
#თუ ქულა 80-დან 89-მდეა, შეფასება იყოს "B".
#თუ ქულა 70-დან 79-მდეა, შეფასება იყოს "C".
#თუ ქულა 60-დან 69-მდეა, შეფასება იყოს "D".
#თუ ქულა 60-ზე ნაკლებია, შეფასება


 


point = int(input("Enter your points: "))

if point > 90:
    print("A")
elif point > 80 < 89:
    print("B")  
elif point > 70 < 79:
    print("C")   
elif point > 60 < 69:
    print("D")       
elif point < 60:
    print("F")

#ინსტრუქციეები
#თუ ასაკი 13-ზე ნაკლებია, დაბეჭდე „მცირეწლოვანი“.
#თუ ასაკი 13-დან 19-მდეა, დაბეჭდე „მოზარდი“.
#თუ ასაკი 20-ზე მეტია, დაბეჭდე „ზრდასრული“.
#რიცხვის დადებითობა ან უარყოფითობა
#პროგრამა სთხოვს მომხმარებელს რიცხვის შეყვანას და შემდეგ ადგენს, არის თუ არა რიცხვი დადებითი, უარყოფითი თუ ნული.

age = int(input("enter your age"))

if age > 13:
    print("you are teenager")
elif age > 20:
    print("you are an adult")
else:
    print("you are an adult")
     
#ინსტრუქციები:
#თუ რიცხვი ნულია, დაბეჭდე „ნულია“.
#თუ რიცხვი ნულზე მეტია, დაბეჭდე „დადებითი რიცხვია“.
#თუ რიცხვი ნულზე ნაკლებია, დაბეჭდე „უარყოფითი რიცხვია“.
#პროდუქტზე ფასდაკლების განსაზღვრა
#მომხმარებელს სთხოვს პროდუქტზე ფასის შეყვანას და შემდეგ ადგენს ფასდაკლების ზომას.

number = int(input("enter your age"))

if 0 < number:
    print("a positive number")
elif 0 > number:
    print("is a negative number")
print(input = "enter your product price")



